{"format": "layers-model", "generatedBy": "keras v2.2.4-tf", "convertedBy": "TensorFlow.js Converter v1.7.2", "modelTopology": {"keras_version": "2.2.4-tf", "backend": "tensorflow", "model_config": {"class_name": "Model", "config": {"name": "model_81", "layers": [{"class_name": "InputLayer", "config": {"batch_input_shape": [null, 64], "dtype": "float32", "sparse": false, "ragged": false, "name": "input_132"}, "name": "input_132", "inbound_nodes": []}, {"class_name": "Embedding", "config": {"name": "embedding_124", "trainable": true, "batch_input_shape": [null, null], "dtype": "float32", "input_dim": 44, "output_dim": 110, "embeddings_initializer": {"class_name": "RandomUniform", "config": {"minval": -0.05, "maxval": 0.05, "seed": null}}, "embeddings_regularizer": null, "activity_regularizer": null, "embeddings_constraint": null, "mask_zero": true, "input_length": null}, "name": "embedding_124", "inbound_nodes": [[["input_132", 0, 0, {}]]]}, {"class_name": "Bidirectional", "config": {"name": "bidirectional_165", "trainable": true, "dtype": "float32", "layer": {"class_name": "LSTM", "config": {"name": "lstm_165", "trainable": true, "dtype": "float32", "return_sequences": true, "return_state": false, "go_backwards": false, "stateful": false, "unroll": false, "time_major": false, "units": 220, "activation": "tanh", "recurrent_activation": "sigmoid", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "unit_forget_bias": true, "kernel_regularizer": null, "recurrent_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "recurrent_constraint": null, "bias_constraint": null, "dropout": 0.1, "recurrent_dropout": 0.0, "implementation": 2}}, "merge_mode": "sum"}, "name": "bidirectional_165", "inbound_nodes": [[["embedding_124", 0, 0, {}]]]}, {"class_name": "Bidirectional", "config": {"name": "bidirectional_166", "trainable": true, "dtype": "float32", "layer": {"class_name": "LSTM", "config": {"name": "lstm_166", "trainable": true, "dtype": "float32", "return_sequences": true, "return_state": false, "go_backwards": false, "stateful": false, "unroll": false, "time_major": false, "units": 220, "activation": "tanh", "recurrent_activation": "sigmoid", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "unit_forget_bias": true, "kernel_regularizer": null, "recurrent_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "recurrent_constraint": null, "bias_constraint": null, "dropout": 0.1, "recurrent_dropout": 0.0, "implementation": 2}}, "merge_mode": "sum"}, "name": "bidirectional_166", "inbound_nodes": [[["bidirectional_165", 0, 0, {}]]]}, {"class_name": "Add", "config": {"name": "add_82", "trainable": true, "dtype": "float32"}, "name": "add_82", "inbound_nodes": [[["bidirectional_165", 0, 0, {}], ["bidirectional_166", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "dense_246", "trainable": true, "dtype": "float32", "units": 16, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "dense_246", "inbound_nodes": [[["add_82", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "dense_247", "trainable": true, "dtype": "float32", "units": 3, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "dense_247", "inbound_nodes": [[["add_82", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "dense_248", "trainable": true, "dtype": "float32", "units": 4, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "dense_248", "inbound_nodes": [[["add_82", 0, 0, {}]]]}, {"class_name": "Softmax", "config": {"name": "N", "trainable": true, "dtype": "float32", "axis": -1}, "name": "N", "inbound_nodes": [[["dense_246", 0, 0, {}]]]}, {"class_name": "Softmax", "config": {"name": "D", "trainable": true, "dtype": "float32", "axis": -1}, "name": "D", "inbound_nodes": [[["dense_247", 0, 0, {}]]]}, {"class_name": "Softmax", "config": {"name": "S", "trainable": true, "dtype": "float32", "axis": -1}, "name": "S", "inbound_nodes": [[["dense_248", 0, 0, {}]]]}], "input_layers": [["input_132", 0, 0]], "output_layers": [["N", 0, 0], ["D", 0, 0], ["S", 0, 0]]}}, "training_config": {"loss": "sparse_categorical_crossentropy", "metrics": ["accuracy"], "weighted_metrics": null, "sample_weight_mode": null, "loss_weights": null, "optimizer_config": {"class_name": "Adam", "config": {"name": "Adam", "learning_rate": 0.0003000000142492354, "decay": 0.0, "beta_1": 0.8999999761581421, "beta_2": 0.9990000128746033, "epsilon": 1e-07, "amsgrad": false}}}}, "weightsManifest": [{"paths": ["group1-shard1of2.bin", "group1-shard2of2.bin"], "weights": [{"name": "bidirectional_165/forward_lstm_165/kernel", "shape": [110, 880], "dtype": "float32"}, {"name": "bidirectional_165/forward_lstm_165/recurrent_kernel", "shape": [220, 880], "dtype": "float32"}, {"name": "bidirectional_165/forward_lstm_165/bias", "shape": [880], "dtype": "float32"}, {"name": "bidirectional_165/backward_lstm_165/kernel", "shape": [110, 880], "dtype": "float32"}, {"name": "bidirectional_165/backward_lstm_165/recurrent_kernel", "shape": [220, 880], "dtype": "float32"}, {"name": "bidirectional_165/backward_lstm_165/bias", "shape": [880], "dtype": "float32"}, {"name": "bidirectional_166/forward_lstm_166/kernel", "shape": [220, 880], "dtype": "float32"}, {"name": "bidirectional_166/forward_lstm_166/recurrent_kernel", "shape": [220, 880], "dtype": "float32"}, {"name": "bidirectional_166/forward_lstm_166/bias", "shape": [880], "dtype": "float32"}, {"name": "bidirectional_166/backward_lstm_166/kernel", "shape": [220, 880], "dtype": "float32"}, {"name": "bidirectional_166/backward_lstm_166/recurrent_kernel", "shape": [220, 880], "dtype": "float32"}, {"name": "bidirectional_166/backward_lstm_166/bias", "shape": [880], "dtype": "float32"}, {"name": "dense_246/kernel", "shape": [220, 16], "dtype": "float32"}, {"name": "dense_246/bias", "shape": [16], "dtype": "float32"}, {"name": "dense_247/kernel", "shape": [220, 3], "dtype": "float32"}, {"name": "dense_247/bias", "shape": [3], "dtype": "float32"}, {"name": "dense_248/kernel", "shape": [220, 4], "dtype": "float32"}, {"name": "dense_248/bias", "shape": [4], "dtype": "float32"}, {"name": "embedding_124/embeddings", "shape": [44, 110], "dtype": "float32"}]}]}