{"format": "layers-model", "generatedBy": "keras v2.2.4-tf", "convertedBy": "TensorFlow.js Converter v1.7.2", "modelTopology": {"keras_version": "2.2.4-tf", "backend": "tensorflow", "model_config": {"class_name": "Model", "config": {"name": "model_14", "layers": [{"class_name": "InputLayer", "config": {"batch_input_shape": [null, 64], "dtype": "float32", "sparse": false, "ragged": false, "name": "input_8"}, "name": "input_8", "inbound_nodes": []}, {"class_name": "Embedding", "config": {"name": "embedding_7", "trainable": true, "batch_input_shape": [null, 64], "dtype": "float32", "input_dim": 44, "output_dim": 90, "embeddings_initializer": {"class_name": "RandomUniform", "config": {"minval": -0.05, "maxval": 0.05, "seed": null}}, "embeddings_regularizer": null, "activity_regularizer": null, "embeddings_constraint": null, "mask_zero": true, "input_length": 64}, "name": "embedding_7", "inbound_nodes": [[["input_8", 0, 0, {}]]]}, {"class_name": "Bidirectional", "config": {"name": "bidirectional_14", "trainable": true, "dtype": "float32", "layer": {"class_name": "LSTM", "config": {"name": "lstm_21", "trainable": true, "dtype": "float32", "return_sequences": true, "return_state": false, "go_backwards": false, "stateful": false, "unroll": false, "time_major": false, "units": 180, "activation": "tanh", "recurrent_activation": "sigmoid", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "unit_forget_bias": true, "kernel_regularizer": null, "recurrent_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "recurrent_constraint": null, "bias_constraint": null, "dropout": 0.0, "recurrent_dropout": 0.0, "implementation": 2}}, "merge_mode": "sum"}, "name": "bidirectional_14", "inbound_nodes": [[["embedding_7", 0, 0, {}]]]}, {"class_name": "Bidirectional", "config": {"name": "bidirectional_15", "trainable": true, "dtype": "float32", "layer": {"class_name": "LSTM", "config": {"name": "lstm_22", "trainable": true, "dtype": "float32", "return_sequences": true, "return_state": false, "go_backwards": false, "stateful": false, "unroll": false, "time_major": false, "units": 180, "activation": "tanh", "recurrent_activation": "sigmoid", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "unit_forget_bias": true, "kernel_regularizer": null, "recurrent_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "recurrent_constraint": null, "bias_constraint": null, "dropout": 0.0, "recurrent_dropout": 0.0, "implementation": 2}}, "merge_mode": "sum"}, "name": "bidirectional_15", "inbound_nodes": [[["bidirectional_14", 0, 0, {}]]]}, {"class_name": "Add", "config": {"name": "add_7", "trainable": true, "dtype": "float32"}, "name": "add_7", "inbound_nodes": [[["bidirectional_14", 0, 0, {}], ["bidirectional_15", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "dense_28", "trainable": true, "dtype": "float32", "units": 16, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "dense_28", "inbound_nodes": [[["add_7", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "dense_29", "trainable": true, "dtype": "float32", "units": 3, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "dense_29", "inbound_nodes": [[["add_7", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "dense_30", "trainable": true, "dtype": "float32", "units": 4, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "dense_30", "inbound_nodes": [[["add_7", 0, 0, {}]]]}, {"class_name": "Softmax", "config": {"name": "N", "trainable": true, "dtype": "float32", "axis": -1}, "name": "N", "inbound_nodes": [[["dense_28", 0, 0, {}]]]}, {"class_name": "Softmax", "config": {"name": "D", "trainable": true, "dtype": "float32", "axis": -1}, "name": "D", "inbound_nodes": [[["dense_29", 0, 0, {}]]]}, {"class_name": "Softmax", "config": {"name": "S", "trainable": true, "dtype": "float32", "axis": -1}, "name": "S", "inbound_nodes": [[["dense_30", 0, 0, {}]]]}], "input_layers": [["input_8", 0, 0]], "output_layers": [["N", 0, 0], ["D", 0, 0], ["S", 0, 0]]}}, "training_config": {"loss": "sparse_categorical_crossentropy", "metrics": ["accuracy"], "weighted_metrics": null, "sample_weight_mode": null, "loss_weights": null, "optimizer_config": {"class_name": "Adam", "config": {"name": "Adam", "learning_rate": 0.000524110859259963, "decay": 0.0, "beta_1": 0.8999999761581421, "beta_2": 0.9990000128746033, "epsilon": 1e-07, "amsgrad": false}}}}, "weightsManifest": [{"paths": ["group1-shard1of1.bin"], "weights": [{"name": "bidirectional_14/forward_lstm_21/kernel", "shape": [90, 720], "dtype": "float32"}, {"name": "bidirectional_14/forward_lstm_21/recurrent_kernel", "shape": [180, 720], "dtype": "float32"}, {"name": "bidirectional_14/forward_lstm_21/bias", "shape": [720], "dtype": "float32"}, {"name": "bidirectional_14/backward_lstm_21/kernel", "shape": [90, 720], "dtype": "float32"}, {"name": "bidirectional_14/backward_lstm_21/recurrent_kernel", "shape": [180, 720], "dtype": "float32"}, {"name": "bidirectional_14/backward_lstm_21/bias", "shape": [720], "dtype": "float32"}, {"name": "bidirectional_15/forward_lstm_22/kernel", "shape": [180, 720], "dtype": "float32"}, {"name": "bidirectional_15/forward_lstm_22/recurrent_kernel", "shape": [180, 720], "dtype": "float32"}, {"name": "bidirectional_15/forward_lstm_22/bias", "shape": [720], "dtype": "float32"}, {"name": "bidirectional_15/backward_lstm_22/kernel", "shape": [180, 720], "dtype": "float32"}, {"name": "bidirectional_15/backward_lstm_22/recurrent_kernel", "shape": [180, 720], "dtype": "float32"}, {"name": "bidirectional_15/backward_lstm_22/bias", "shape": [720], "dtype": "float32"}, {"name": "dense_28/kernel", "shape": [180, 16], "dtype": "float32"}, {"name": "dense_28/bias", "shape": [16], "dtype": "float32"}, {"name": "dense_29/kernel", "shape": [180, 3], "dtype": "float32"}, {"name": "dense_29/bias", "shape": [3], "dtype": "float32"}, {"name": "dense_30/kernel", "shape": [180, 4], "dtype": "float32"}, {"name": "dense_30/bias", "shape": [4], "dtype": "float32"}, {"name": "embedding_7/embeddings", "shape": [44, 90], "dtype": "float32"}]}]}