{"format": "layers-model", "generatedBy": "keras v2.3.0-tf", "convertedBy": "TensorFlow.js Converter v2.0.1.post1", "modelTopology": {"keras_version": "2.3.0-tf", "backend": "tensorflow", "model_config": {"class_name": "Model", "config": {"name": "model_7", "layers": [{"class_name": "InputLayer", "config": {"batch_input_shape": [null, 64], "dtype": "float32", "sparse": false, "ragged": false, "name": "input_8"}, "name": "input_8", "inbound_nodes": []}, {"class_name": "Embedding", "config": {"name": "embedding_7", "trainable": true, "batch_input_shape": [null, null], "dtype": "float32", "input_dim": 44, "output_dim": 500, "embeddings_initializer": {"class_name": "RandomUniform", "config": {"minval": -0.05, "maxval": 0.05, "seed": null}}, "embeddings_regularizer": null, "activity_regularizer": null, "embeddings_constraint": null, "mask_zero": true, "input_length": null}, "name": "embedding_7", "inbound_nodes": [[["input_8", 0, 0, {}]]]}, {"class_name": "Bidirectional", "config": {"name": "bidirectional_14", "trainable": true, "dtype": "float32", "layer": {"class_name": "LSTM", "config": {"name": "lstm_14", "trainable": true, "dtype": "float32", "return_sequences": true, "return_state": false, "go_backwards": false, "stateful": false, "unroll": false, "time_major": false, "units": 500, "activation": "tanh", "recurrent_activation": "sigmoid", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "unit_forget_bias": true, "kernel_regularizer": null, "recurrent_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "recurrent_constraint": null, "bias_constraint": null, "dropout": 0.0, "recurrent_dropout": 0.0, "implementation": 2}}, "merge_mode": "sum"}, "name": "bidirectional_14", "inbound_nodes": [[["embedding_7", 0, 0, {}]]]}, {"class_name": "Bidirectional", "config": {"name": "bidirectional_15", "trainable": true, "dtype": "float32", "layer": {"class_name": "LSTM", "config": {"name": "lstm_15", "trainable": true, "dtype": "float32", "return_sequences": true, "return_state": false, "go_backwards": false, "stateful": false, "unroll": false, "time_major": false, "units": 500, "activation": "tanh", "recurrent_activation": "sigmoid", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "unit_forget_bias": true, "kernel_regularizer": null, "recurrent_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "recurrent_constraint": null, "bias_constraint": null, "dropout": 0.0, "recurrent_dropout": 0.0, "implementation": 2}}, "merge_mode": "sum"}, "name": "bidirectional_15", "inbound_nodes": [[["bidirectional_14", 0, 0, {}]]]}, {"class_name": "Add", "config": {"name": "add_3", "trainable": true, "dtype": "float32"}, "name": "add_3", "inbound_nodes": [[["bidirectional_14", 0, 0, {}], ["bidirectional_15", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_7", "trainable": true, "dtype": "float32", "axis": [2], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "batch_normalization_7", "inbound_nodes": [[["add_3", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "dense_28", "trainable": true, "dtype": "float32", "units": 500, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "dense_28", "inbound_nodes": [[["batch_normalization_7", 0, 0, {}]]]}, {"class_name": "Add", "config": {"name": "add_4", "trainable": true, "dtype": "float32"}, "name": "add_4", "inbound_nodes": [[["embedding_7", 0, 0, {}], ["dense_28", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "dense_29", "trainable": true, "dtype": "float32", "units": 16, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "dense_29", "inbound_nodes": [[["add_4", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "dense_30", "trainable": true, "dtype": "float32", "units": 3, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "dense_30", "inbound_nodes": [[["add_4", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "dense_31", "trainable": true, "dtype": "float32", "units": 4, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "dense_31", "inbound_nodes": [[["add_4", 0, 0, {}]]]}, {"class_name": "Softmax", "config": {"name": "N", "trainable": true, "dtype": "float32", "axis": -1}, "name": "N", "inbound_nodes": [[["dense_29", 0, 0, {}]]]}, {"class_name": "Softmax", "config": {"name": "D", "trainable": true, "dtype": "float32", "axis": -1}, "name": "D", "inbound_nodes": [[["dense_30", 0, 0, {}]]]}, {"class_name": "Softmax", "config": {"name": "S", "trainable": true, "dtype": "float32", "axis": -1}, "name": "S", "inbound_nodes": [[["dense_31", 0, 0, {}]]]}], "input_layers": [["input_8", 0, 0]], "output_layers": [["N", 0, 0], ["D", 0, 0], ["S", 0, 0]]}}, "training_config": {"loss": "sparse_categorical_crossentropy", "metrics": {"N": "accuracy", "D": "accuracy", "S": "accuracy"}, "weighted_metrics": null, "loss_weights": null, "sample_weight_mode": null, "optimizer_config": {"class_name": "RMSprop", "config": {"name": "RMSprop", "learning_rate": 0.001, "decay": 0.0, "rho": 0.9, "momentum": 0.0, "epsilon": 1e-07, "centered": false}}}}, "weightsManifest": [{"paths": ["group1-shard1of8.bin", "group1-shard2of8.bin", "group1-shard3of8.bin", "group1-shard4of8.bin", "group1-shard5of8.bin", "group1-shard6of8.bin", "group1-shard7of8.bin", "group1-shard8of8.bin"], "weights": [{"name": "batch_normalization_7/gamma", "shape": [500], "dtype": "float32"}, {"name": "batch_normalization_7/beta", "shape": [500], "dtype": "float32"}, {"name": "batch_normalization_7/moving_mean", "shape": [500], "dtype": "float32"}, {"name": "batch_normalization_7/moving_variance", "shape": [500], "dtype": "float32"}, {"name": "bidirectional_14/forward_lstm_14/lstm_cell_43/kernel", "shape": [500, 2000], "dtype": "float32"}, {"name": "bidirectional_14/forward_lstm_14/lstm_cell_43/recurrent_kernel", "shape": [500, 2000], "dtype": "float32"}, {"name": "bidirectional_14/forward_lstm_14/lstm_cell_43/bias", "shape": [2000], "dtype": "float32"}, {"name": "bidirectional_14/backward_lstm_14/lstm_cell_44/kernel", "shape": [500, 2000], "dtype": "float32"}, {"name": "bidirectional_14/backward_lstm_14/lstm_cell_44/recurrent_kernel", "shape": [500, 2000], "dtype": "float32"}, {"name": "bidirectional_14/backward_lstm_14/lstm_cell_44/bias", "shape": [2000], "dtype": "float32"}, {"name": "bidirectional_15/forward_lstm_15/lstm_cell_46/kernel", "shape": [500, 2000], "dtype": "float32"}, {"name": "bidirectional_15/forward_lstm_15/lstm_cell_46/recurrent_kernel", "shape": [500, 2000], "dtype": "float32"}, {"name": "bidirectional_15/forward_lstm_15/lstm_cell_46/bias", "shape": [2000], "dtype": "float32"}, {"name": "bidirectional_15/backward_lstm_15/lstm_cell_47/kernel", "shape": [500, 2000], "dtype": "float32"}, {"name": "bidirectional_15/backward_lstm_15/lstm_cell_47/recurrent_kernel", "shape": [500, 2000], "dtype": "float32"}, {"name": "bidirectional_15/backward_lstm_15/lstm_cell_47/bias", "shape": [2000], "dtype": "float32"}, {"name": "dense_28/kernel", "shape": [500, 500], "dtype": "float32"}, {"name": "dense_28/bias", "shape": [500], "dtype": "float32"}, {"name": "dense_29/kernel", "shape": [500, 16], "dtype": "float32"}, {"name": "dense_29/bias", "shape": [16], "dtype": "float32"}, {"name": "dense_30/kernel", "shape": [500, 3], "dtype": "float32"}, {"name": "dense_30/bias", "shape": [3], "dtype": "float32"}, {"name": "dense_31/kernel", "shape": [500, 4], "dtype": "float32"}, {"name": "dense_31/bias", "shape": [4], "dtype": "float32"}, {"name": "embedding_7/embeddings", "shape": [44, 500], "dtype": "float32"}]}]}