{"format": "layers-model", "generatedBy": "keras v2.2.4-tf", "convertedBy": "TensorFlow.js Converter v1.7.2", "modelTopology": {"keras_version": "2.2.4-tf", "backend": "tensorflow", "model_config": {"class_name": "Model", "config": {"name": "model_18", "layers": [{"class_name": "InputLayer", "config": {"batch_input_shape": [null, 64], "dtype": "float32", "sparse": false, "ragged": false, "name": "input_19"}, "name": "input_19", "inbound_nodes": []}, {"class_name": "Embedding", "config": {"name": "embedding_18", "trainable": true, "batch_input_shape": [null, 64], "dtype": "float32", "input_dim": 44, "output_dim": 45, "embeddings_initializer": {"class_name": "RandomUniform", "config": {"minval": -0.05, "maxval": 0.05, "seed": null}}, "embeddings_regularizer": null, "activity_regularizer": null, "embeddings_constraint": null, "mask_zero": true, "input_length": 64}, "name": "embedding_18", "inbound_nodes": [[["input_19", 0, 0, {}]]]}, {"class_name": "Bidirectional", "config": {"name": "bidirectional_36", "trainable": true, "dtype": "float32", "layer": {"class_name": "LSTM", "config": {"name": "lstm_36", "trainable": true, "dtype": "float32", "return_sequences": true, "return_state": false, "go_backwards": false, "stateful": false, "unroll": false, "time_major": false, "units": 190, "activation": "tanh", "recurrent_activation": "sigmoid", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "unit_forget_bias": true, "kernel_regularizer": null, "recurrent_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "recurrent_constraint": null, "bias_constraint": null, "dropout": 0.0, "recurrent_dropout": 0.0, "implementation": 2}}, "merge_mode": "sum"}, "name": "bidirectional_36", "inbound_nodes": [[["embedding_18", 0, 0, {}]]]}, {"class_name": "Bidirectional", "config": {"name": "bidirectional_37", "trainable": true, "dtype": "float32", "layer": {"class_name": "LSTM", "config": {"name": "lstm_37", "trainable": true, "dtype": "float32", "return_sequences": true, "return_state": false, "go_backwards": false, "stateful": false, "unroll": false, "time_major": false, "units": 190, "activation": "tanh", "recurrent_activation": "sigmoid", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "unit_forget_bias": true, "kernel_regularizer": null, "recurrent_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "recurrent_constraint": null, "bias_constraint": null, "dropout": 0.0, "recurrent_dropout": 0.0, "implementation": 2}}, "merge_mode": "sum"}, "name": "bidirectional_37", "inbound_nodes": [[["bidirectional_36", 0, 0, {}]]]}, {"class_name": "Add", "config": {"name": "add_18", "trainable": true, "dtype": "float32"}, "name": "add_18", "inbound_nodes": [[["bidirectional_36", 0, 0, {}], ["bidirectional_37", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "dense_54", "trainable": true, "dtype": "float32", "units": 16, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "dense_54", "inbound_nodes": [[["add_18", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "dense_55", "trainable": true, "dtype": "float32", "units": 3, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "dense_55", "inbound_nodes": [[["add_18", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "dense_56", "trainable": true, "dtype": "float32", "units": 4, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "dense_56", "inbound_nodes": [[["add_18", 0, 0, {}]]]}, {"class_name": "Softmax", "config": {"name": "N", "trainable": true, "dtype": "float32", "axis": -1}, "name": "N", "inbound_nodes": [[["dense_54", 0, 0, {}]]]}, {"class_name": "Softmax", "config": {"name": "D", "trainable": true, "dtype": "float32", "axis": -1}, "name": "D", "inbound_nodes": [[["dense_55", 0, 0, {}]]]}, {"class_name": "Softmax", "config": {"name": "S", "trainable": true, "dtype": "float32", "axis": -1}, "name": "S", "inbound_nodes": [[["dense_56", 0, 0, {}]]]}], "input_layers": [["input_19", 0, 0]], "output_layers": [["N", 0, 0], ["D", 0, 0], ["S", 0, 0]]}}, "training_config": {"loss": "sparse_categorical_crossentropy", "metrics": ["accuracy"], "weighted_metrics": null, "sample_weight_mode": null, "loss_weights": null, "optimizer_config": {"class_name": "Adam", "config": {"name": "Adam", "learning_rate": 0.0005037622177042067, "decay": 0.0, "beta_1": 0.8999999761581421, "beta_2": 0.9990000128746033, "epsilon": 1e-07, "amsgrad": false}}}}, "weightsManifest": [{"paths": ["group1-shard1of1.bin"], "weights": [{"name": "bidirectional_36/forward_lstm_36/kernel", "shape": [45, 760], "dtype": "float32"}, {"name": "bidirectional_36/forward_lstm_36/recurrent_kernel", "shape": [190, 760], "dtype": "float32"}, {"name": "bidirectional_36/forward_lstm_36/bias", "shape": [760], "dtype": "float32"}, {"name": "bidirectional_36/backward_lstm_36/kernel", "shape": [45, 760], "dtype": "float32"}, {"name": "bidirectional_36/backward_lstm_36/recurrent_kernel", "shape": [190, 760], "dtype": "float32"}, {"name": "bidirectional_36/backward_lstm_36/bias", "shape": [760], "dtype": "float32"}, {"name": "bidirectional_37/forward_lstm_37/kernel", "shape": [190, 760], "dtype": "float32"}, {"name": "bidirectional_37/forward_lstm_37/recurrent_kernel", "shape": [190, 760], "dtype": "float32"}, {"name": "bidirectional_37/forward_lstm_37/bias", "shape": [760], "dtype": "float32"}, {"name": "bidirectional_37/backward_lstm_37/kernel", "shape": [190, 760], "dtype": "float32"}, {"name": "bidirectional_37/backward_lstm_37/recurrent_kernel", "shape": [190, 760], "dtype": "float32"}, {"name": "bidirectional_37/backward_lstm_37/bias", "shape": [760], "dtype": "float32"}, {"name": "dense_54/kernel", "shape": [190, 16], "dtype": "float32"}, {"name": "dense_54/bias", "shape": [16], "dtype": "float32"}, {"name": "dense_55/kernel", "shape": [190, 3], "dtype": "float32"}, {"name": "dense_55/bias", "shape": [3], "dtype": "float32"}, {"name": "dense_56/kernel", "shape": [190, 4], "dtype": "float32"}, {"name": "dense_56/bias", "shape": [4], "dtype": "float32"}, {"name": "embedding_18/embeddings", "shape": [44, 45], "dtype": "float32"}]}]}